In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [11]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
index = ['Linha ' + str(i) for i in range(5)]

In [8]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [13]:
s = pd.Series(data, index = index)

In [14]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [16]:
data = {'Linha '+ str(i): i + 1 for i in range(5)}

In [17]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [18]:
s = pd.Series(data)

In [19]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [20]:
s1 = s + 2

In [21]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

# DataFrame

In [22]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [23]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [25]:
df1 = pd.DataFrame(data = data)

In [26]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
index = ['Linha '+ str(i) for i in range(3)]

In [28]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [29]:
df1 = pd.DataFrame(data = data, index = index )

In [30]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [32]:
columns = ['Coluna '+ str(i) for i in range(3)]

In [33]:
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [34]:
df2 = pd.DataFrame(data = data, index = index, columns = columns )

In [35]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [62]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [63]:
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [64]:
df3 = pd.DataFrame(data)

In [65]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [66]:
data = [(1,2,3), (4,5,6), (7,8,9)]

In [41]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [42]:
df4 = pd.DataFrame(data = data, index = index, columns = columns )

In [43]:
df4

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [73]:
df2[df2 > 0] ='A'

In [74]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [67]:
df3[df3 > 0] ='B'

In [68]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [48]:
df4[df4 > 0] ='C'

In [49]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [82]:
df5 = pd.concat([df2, df3, df4])

In [83]:
df5

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [84]:
df5 = pd.concat([df2, df3, df4], axis=1)

In [85]:
df5

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

In [94]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4

In [95]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6